app/Controllers/EmployeeController.php

    public function getEmployee()
    {
       $request = service('request');
       $postData = $request->getPost();

       $dtpostData = $postData['data'];
       $response = array();
       ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];
       $sessData = getSessionData();

       ## Total number of records without filtering
       $cm = new EmployeeModel();
       $totalRecords = $cm->select('id')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `employees`