app/Controllers/ItemsController.php

    public function getDepartment()
    {
       $request = service('request');
       $postData = $request->getPost();
       $dtpostData = $postData['data'];
       $response = array();
       $sessData = getSessionData();
        ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       ## Total number of records without filtering
       $i = new DepartmentModel();
       $ft = new DepartmentModel();

       $totalRecords = $i->select('id')->where('pos_id',$sessData['pos_id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `department`
WHERE `pos_id` = '1'

    public function getCategory()
    {
       $request = service('request');
       $postData = $request->getPost();

       $dtpostData = $postData['data'];
       $response = array();
        ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = 20; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       // $searchValue = $advancesearchValue['match']['search'];

       ## Total number of records without filtering
       $cm = new CategoryModel();
       $totalRecords = $cm->select('id')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `categories`

    public function getSubcategory()
    {
       $request = service('request');
       $postData = $request->getPost();
       $dtpostData = $postData['data'];
       $response = array();
       $sessData = getSessionData();
        ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       ## Total number of records without filtering
       $i = new SubcategoryModel();
       $ft = new SubcategoryModel();

       $totalRecords = $i->select('id')->where('pos_id',$sessData['pos_id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `subcategories`
WHERE `pos_id` = '1'

    public function getModifiers()
    {

        $request = service('request');
        $postData = $request->getPost();
        $dtpostData = $postData['data'];
        $response = array();

        $draw = $dtpostData['draw'];
        $start = $dtpostData['start'];
        $rowperpage = $dtpostData['length'];
        $columnIndex = $dtpostData['order'][0]['column'];
        $columnName = $dtpostData['columns'][$columnIndex]['data'];
        $columnSortOrder = $dtpostData['order'][0]['dir'];
        $advancesearchValue = $dtpostData['advFilter'];
        $searchValue = $advancesearchValue['match']['search'];

        $cm = new ModifiersModel();
        $cmItems = new ModifierItemsModel();
        $totalRecords = $cm->select('id')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `modifiers`

        $totalRecordwithFilter = count($records);

        foreach($records as $key=>$row){
            $product = $cmItems->select('items.item_name')
                    ->join('items','items.id = modifier_items.item_id')->where('modifier_items.modifier_id',$row['id'])->first();
---
SELECT `items`.`item_name`
FROM `modifier_items`
JOIN `items` ON `items`.`id` = `modifier_items`.`item_id`
WHERE `modifier_items`.`modifier_id` = '1'
 LIMIT 1

    public function getBrand()
    {

       $request = service('request');
       $postData = $request->getPost();

       $dtpostData = $postData['data'];
       $response = array();
        ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];

       ## Total number of records without filtering
       $cm = new BrandmasterModel();
       $totalRecords = $cm->select('id')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `brandmasters`

    public function getLocation()
    {
       $request = service('request');
       $postData = $request->getPost();
       $sessData = getSessionData();

       $dtpostData = $postData['data'];
       $response = array();
        ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];

       ## Total number of records without filtering
       $i = new Location();
       $ft = new Location();

       $totalRecords = $i->select('id')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `location`

    public function getItem()
    {
       $request = service('request');
       $postData = $request->getPost();
       $dtpostData = $postData['data'];
       $response = array();
       $sessData = getSessionData();
        ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];

       ## Total number of records without filtering
       $i = new ItemModel();
       $ft = new ItemModel();

       $totalRecords = $i->select('id')->where('pos_id',$sessData['pos_id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `pos_id` = '1'