app/Controllers/SettingsController.php

    public function index()
    {
        $data = [];
        $data['title'] = 'Settings';
        $sessData = getSessionData();
        $data['permission'] = $sessData['permissions'];

        $currencyModel = new CurrencyModel();
        $data['currencies'] = $currencyModel->findAll();

        $terminalModel = new TerminalsModel();
        $data['terminals'] = $terminalModel->findAll();

        $taxesModel = new TaxesModel();
        $data['taxes'] = $taxesModel->GetTaxMasterData();

        $employeeModel = new EmployeeModel();
        $data['employees'] = $employeeModel->GetAllEmployeeData();

        $storeModel = new StoreModel();

        $paymentModel = new PaymentModel();
        $data['payments'] = $paymentModel->GetGoodsReceivedData();

        $weighingmasterModel = new WeighingScaleMaster();
        $data['weighing_master'] = $weighingmasterModel->findAll();

        $weighingscale = new WeighingScaleModel();
        $data['weighingscales'] = $weighingscale->first();
---
SELECT *
FROM `currencies`
SELECT *
FROM `terminals`
SELECT *
FROM `weighing_scale_master`
SELECT *
FROM `weighingscales`
 LIMIT 1

        $data['base_currency'] = "";
        if($sessData['store_id'] != "") {
            $general = new GeneralModel();
            $generalData = $general->select('general.id,c.currency_code')->join('currencies as c','general.currency_id = c.id')->where('general.store_id',$sessData['store_id'])->first();
---
SELECT `general`.`id`, `c`.`currency_code`
FROM `general`
JOIN `currencies` as `c` ON `general`.`currency_id` = `c`.`id`
WHERE `general`.`store_id` = '3'
 LIMIT 1

            $storeModel->where('pos_id',$sessData['pos_id']);
            $currencyModel->where('pos_id',$sessData['pos_id']);
        }
        $data['stores'] = $storeModel->findAll();
---
SELECT *
FROM `stores`

        $location_master = new LocationMaster();
        $data['location_master'] = $location_master->where('pos_id',$sessData['pos_id'])->findAll();

        $data['currency'] = $currencyModel->findAll();
        $data['sessionRole'] = $sessData['role_name'];
        //For Filter
        $paymentmasterModel = new PaymentMasterModel();
        $data['payment_master'] = $paymentmasterModel->where('status', 1)->findAll();
---
SELECT *
FROM `currencies`
SELECT *
FROM `tax_master`
WHERE `status` = 1

        $data['tax'] = $taxmasterModel->where('status', 1)->findAll();

        $employeeModel = new EmployeeModel();
        $data['employee'] = $employeeModel->findAll();

        $roleModel = new RoleModel();
        $data['role'] = $roleModel->findAll();
---
SELECT *
FROM `employees`
SELECT *
FROM `role`

    public function Add_Terminal()
    {
        $data = [];
        $data['title'] = 'Add Terminals';
        $data['main_menu'] = 'Settings';
        $data['main_menu_url'] = base_url('settings');

        $sessData = getSessionData();

        $storeModel = new StoreModel();
        $storeModel->where('pos_id',$sessData['pos_id']);

        $data['stores'] = $storeModel->where('status', 1)->findAll();

        $location = new Location();
        $data['location'] = $location->where('pos_id',$sessData['pos_id'])->where('status',1)->findAll();
---
SELECT *
FROM `stores`
WHERE `pos_id` = '1'
AND `status` = 1
SELECT *
FROM `location`
WHERE `pos_id` = '1'
AND `status` = 1

    public function getPaymenttype()
    {
       $request = service('request');
       $postData = $request->getPost();

       $dtpostData = $postData['data'];
       $response = array();
      ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];

       ## Total number of records without filtering
       $cm = new PaymentModel();
       $totalRecords = $cm->select('id')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `payments`

   public function getTax()
    {
       $request = service('request');
       $postData = $request->getPost();

       $dtpostData = $postData['data'];
       $response = array();
       ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];

       ## Total number of records without filtering
       $cm = new TaxesModel();
       $totalRecords = $cm->select('id')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `taxes`

   public function getStore()
    {
       $request = service('request');
       $postData = $request->getPost();

       $dtpostData = $postData['data'];
       $response = array();
       ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];

       $sessData = getSessionData();
       ## Total number of records without filtering
       $cm = new StoreModel();
       $totalRecords = $cm->select('id')->where('pos_id',$sessData['pos_id'])
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `stores`
WHERE `pos_id` = '1'

    public function getTerminal()
    {
       $request = service('request');
       $postData = $request->getPost();

       $dtpostData = $postData['data'];
       $response = array();
       ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];
       $sessData = getSessionData();

       ## Total number of records without filtering
       $cm = new TerminalsModel();
       $totalRecords = $cm->select('id')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `terminals`

   public function getCurrency()
   {
       $request = service('request');
       $postData = $request->getPost();
       $dtpostData = $postData['data'];
       $response = array();
       ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $advancesearchValue = $dtpostData['advFilter']; // Search value
       $searchValue = $advancesearchValue['match']['search'];

       $sessData = getSessionData();
       $generalData = "";
       if($sessData['store_id'] != "") {
            $general = new GeneralModel();
            $generalData = $general->where('store_id',$sessData['store_id'])->first();
       }
       ## Total number of records without filtering
       $cm = new CurrencyModel();
       $totalRecords = $cm->select('id')
                ->countAllResults();
---
SELECT *
FROM `general`
WHERE `store_id` = '3'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `currencies`