app/Models/SubcategoryModel.php

SELECT *
FROM `subcategories`
WHERE `category_id` = '8'
---
     public function GetSubCategoryData($id) {
            $this->table('subcategories')->select("*");
            $this->where('category_id',$id);
            return $this->findAll();